# 2023-03-22 Wen

print("오늘은 파이썬 수업입니다.")
print('hello !!')

print(type("오늘은 파이썬 수업입니다."))
print(2)
print(5.5)
print(type(2))
print(type(5.67))
print("Life" + " too short")
print("213호" * 3)
print("hello","hello","213")
print("hello","hello",213," ",11111)

print("hello" + " Python!")
print("hello",33)

print(1,2,-5,3.14,2.71828)
print('Hi', 'Python')

print('23000원은','5000원 ?개','1000원 ?개')
print('5000원',23000//5000,'개')
print('1000원',(23000%5000)//1000,'개')

print("3+8")
print(3+8)
print("3+8 = ",3+8)

var = '3+8'
print(eval(var))
print(var)
'''python은 기본형을 사용하지 않아도 사용가능!'''

print(1+62-3*52)
print(256*553-152)

print(162353290930//539253 + 162353290930%539253)


print("식당에서 계산하고 거스름돈 돌려받기")
'''78,000 == ? * 50,000 + 10,000 + ? * 5,000'''
print('5만원 짜리',(78000//50000),'장','1만원짜리',((78000%50000)//10000),'장','5천원 짜리',(((78000%50000)%10000)//5000),'장')
print('5만원 짜리',(80000//50000),'장','1만원짜리',((80000%50000)//10000),'장',)